cask_args appdir: '/Applications'

tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "sidneys/homebrew"

brew "awscli"
brew "awsume"
brew "bitwarden-cli"
brew "curl"
brew "chezmoi"
brew "dive"
brew "dockutil"
brew "git"
brew "go"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "node"
brew "terraform"
brew "terragrunt"
brew "terrascan"
brew "tflint"
brew "wget"
brew "yamllint"
brew "yarn"
brew "ykman"
brew "zsh"

cask "bitwarden"
cask "docker"
cask "ferdi"
cask "google-chrome"
cask "kitty"
cask "rectangle"
cask "slack"
cask "stats"
cask "tunnelblick"
cask "visual-studio-code"
cask "zoom"

# UTM: VM Manager based on Qemu
cask "utm"

# UTM Windows dependencies
brew "aria2"
brew "cabextract"
brew "cdrtools"
brew "openssl"
brew "sidneys/homebrew/chntpw"
brew "wimlib"
