## Taps
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-versions"

## Brews

# age - file encryption
brew "age"

# chezmoi - dotfiles management
brew "chezmoi"

# curl - transfer url
brew "curl"

# dlv - debugger for go
brew "dlv"

# git - the stupid content tracker
brew "git"

# git-extras - git utilities
brew "git-extras"

# gnupg - privacy guard
brew "gnupg"

# go - golang
brew "go"

# gopls - go language server
brew "gopls"

# goreleaser - release go
brew "goreleaser"

# helm - package manager for kubernetes
brew "helm"

# jq - command-line JSON processor
brew "jq"

# kubectx - k8s context switcher
brew "kubectx"

# kubernetes-cli - kubectl
brew "kubernetes-cli"

# mas - Mac App Store command-line interface
brew "mas"

# openshift-cli - OpenShift command-line interface
brew "openshift-cli"

# powerlevel10k - theme for Zsh
brew "powerlevel10k"

# sops - tool for managing secrets
brew "sops"

# staticcheck - golang linter
brew "staticcheck"

# terraform - infrastructure as code
brew "terraform"

# yamllint - linter for YAML files
brew "yamllint"

# zsh - the Z shell
brew "zsh"

## Casks

# 1Password - password manager
cask "1password-beta"

# 1Password cli - cli for 1pass
cask "1password-cli"

# Arc - cool browser
cask "arc"

# Crossover - wine emulator
cask "crossover"

# Discord - chat and call app (but for gamers)
cask "discord"

# Docker - containerize all the things
cask "docker"

# Google Chrome - browser, the common one
cask "google-chrome"

# Hidden Bar - hide menu bar icons
cask "hiddenbar"

# Keeping You Awake - prevents mac from going to sleep
cask "keepingyouawake"

# Logitech G Hub - mouse macros, i hate it
cask "logitech-g-hub"

# Messanger - social messages
cask "messenger"

# Microsoft Teams - work calls or chats, i hate it as well
cask "microsoft-teams"

# Obsidian - markdown editor, second brain (not mine tho)
cask "obsidian"

# Prism Launcher - mc launcher, switch when this one as well becomes deprecated
cask "prismlauncher"

# Rectangle - move and resize windows, might look into yabai as well
cask "rectangle"

# Slack - work chat, a good one
cask "slack"

# Stats - system monitor in menu bar
cask "stats"

# Tunnelblick - ovpn client
cask "tunnelblick"

# Unnatural Scroll Wheels - fix mouse scroll
cask "unnaturalscrollwheels"

# UTM - VM utility using QEMU
cask "utm"

# VSCode - code editor, IDE wannabe
cask "visual-studio-code"

# Warp - modern terminal emulator
cask "warp"

# Zoom - work calls
cask "zoom"

# Prime Video - amazon flavour video stream
mas "Prime Video", id: 545519333

# WireGuard - wg vpn client
mas "WireGuard", id: 1451685025
