cask_args appdir: '/Applications'

tap "earthly/earthly"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "sidneys/homebrew"

brew "ansible"
brew "awscli"
brew "awsume"
brew "bitwarden-cli"
brew "curl"
brew "chezmoi"
brew "dive"
brew "dockutil"
brew "git"
brew "go"
brew "helm"
brew "jq"
brew "kubernetes-cli@1.22"
brew "megatools"
brew "node"
brew "terraform"
brew "terragrunt"
brew "terrascan"
brew "tflint"
brew "wget"
brew "yamllint"
brew "yarn"
brew "ykman"
brew "zsh"

# Earthly - Docker companion tool
brew "earthly/earthly/earthly"

# Rclone - Mount remote S3 buckets and other storage
brew "rclone"

# OpenRCT2 - Open source RollerCoaster Tycoon 2
brew "openrct2"

# Node Canvas - Dependencies
brew "pkg-config"
brew "cairo"
brew "pango"
brew "libpng"
brew "jpeg" 
brew "giflib"
brew "librsvg"
brew "ffmpeg"

cask "bitwarden"
cask "docker"
cask "ferdi"
cask "google-chrome"
cask "kitty"
cask "rectangle"
cask "slack"
cask "stats"
cask "tunnelblick"
cask "visual-studio-code"
cask "zoom"

# UTM: VM Manager based on Qemu
cask "utm"

# UTM Windows dependencies
brew "aria2"
brew "cabextract"
brew "cdrtools"
brew "openssl"
brew "sidneys/homebrew/chntpw"
brew "wimlib"
brew "libusb"

# Wine - (Not) a Windows Emulator
cask "wine-stable"

# Discord - Chat app to talk to strangers and maybe friends
cask "discord"

# Parsec - App to stream a Windows host with low latency
cask "parsec"

# Microsoft RDP - App to stream a Windows host with (extreme) latency
cask "microsoft-remote-desktop"

# Zero Tier - Mesh VPN Client
cask "zerotier-one"

# Epic Games Store - Sometimes I like to have fun, sue me
cask "epic-games"

# Logitech G-Hub - Logitech G Mouse software
cask "logitech-g-hub"

# Unnatural Scroll Wheels - Keep Touchpad natural scrolling and switch to the other on the Mouse
cask "unnaturalscrollwheels"

# Flutter - Flutter framework and it's dependencies
cask "android-studio"
cask "android-sdk"
cask "android-ndk"
cask "flutter"

# Temurin - Free java
cask "temurin8"
cask "temurin"

# MultiMC - Minecraft Client
cask "multimc"

# Rar - RAR Unpack tool
cask "rar"

# Parallels - Finally some good VM management software in here
cask "parallels"

# Balena Etcher - Write to USB
cask "balenaetcher"

# Google Cloud SDK
cask "google-cloud-sdk"
